/**
 * 平台状态-设备数量
 */

exports.check = function () {
    return false;
};

exports.mockData = function () {

    return {
    "code": 0,
    "info": [
        {
            "form": {
                "size": 2,
                "device": 1
            }
        }
    ],
    "data": {
        "xAxis": [
            "11月01日",
            "11月02日",
            "11月03日",
            "11月04日",
            "11月05日",
            "11月06日",
            "11月07日",
            "11月08日",
            "11月09日",
            "11月10日",
            "11月11日",
            "11月12日",
            "11月13日",
            "11月14日",
            "11月15日",
            "11月16日",
            "11月17日"
        ],
        "title": "交换机",
        "yAxis": [
            {
                "unit": "个",
                "name": "总数",
                "data": [
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    1000,
                    100
                ]
            },
            {
                "unit": "个",
                "name": "在线数",
                "data": [
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    12,
                    45
                ]
            }
        ],
        "sum": 45
    }
}

};
